app/views/articles/show.html.erb

<%= link_to "<< Back to Articles List", articles_path %>
<h3>Comments (<%= @article.comments.size %>)</h3>
---
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 2]]