app/controllers/articles_controller.rb

  def update
    @article = Article.find(params[:id])
    @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "6th title - flash"], ["body", "this is my sixth one after testing flash."], ["updated_at", "2020-07-20 20:13:19.000007"], ["id", 11]]